uhnp/src/Catalogs/тн_ПрофилиХраненияФайловЭД/тн_ПрофилиХраненияФайловЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тн_ПрофилиХраненияФайловЭД</name>
  <comment>//Смирнов Д.А. 04.07.2025 Выполнение задач №000052291</comment>
  <attributes>
    <name>ОператорЭДО</name>
    <type>
      <types>EnumRef.тн_ОператорыЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокументовВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСхемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/тн_ПрофилиХраненияФайловЭД/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.СпособОтправки = "RabbitMQ";
		Объект.НаименованиеСхемы = "systemsToeda_create_document_v1";
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОператорЭДОПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОператорЭДО) Тогда
		ТекстСпособОтправки = ?(ЗначениеЗаполнено(Объект.СпособОтправки), "(" + Объект.СпособОтправки + ")", "");
		Объект.Наименование = Строка(Объект.ОператорЭДО) + " " + ТекстСпособОтправки;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СпособОтправкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОператорЭДО) Тогда
		ТекстСпособОтправки = ?(ЗначениеЗаполнено(Объект.СпособОтправки), "(" + Объект.СпособОтправки + ")", "");
		Объект.Наименование = Строка(Объект.ОператорЭДО) + " " + ТекстСпособОтправки;	
	КонецЕсли;	
	
КонецПроцедуры
